---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFileWriteOptions.Dispose
source: html/889cde58-000c-b7ae-cc22-cadebe048086.htm
---
# Autodesk.Revit.DB.IFC.IFCFileWriteOptions.Dispose Method

Releases all resources used by the IFCFileWriteOptions

## Syntax (C#)
```csharp
public void Dispose()
```